@extends('layout.main-layout')

@section('content')
<div class="jumbotron dilivery__jumbotron">
  <h1>Официальный дилер ASP.</h1>
</div>
<div class="container delivery__container">
  <div class="breadcrumbs">
    <div class="breadcrumbs__container">
      <a href="/">Главная</a>
      <span> / </span>
      <span>Оплата и доставка</span>
    </div>
  </div>
  <div class="delivery__title">
    Оплата.
  </div>
  <div class="delivery__content">
    <div class="delivery__method">
      <p>Платежи принимаются по банковским картам Visa/MasterCard через платежную систему ОАО "Сбербанк России".</p>
    </div>
    <div class="delivery__method">
      <p>Платежи принимаются через систему «Яндекс-Деньги».</p>
    </div>
    <div class="delivery__method">
      <p>Наличными, курьеру при получении заказа (только для жителей Санкт-Петербурга)</p>
    </div>
  </div>
  <div class="delivery__title">
    Мы предлагаем несокольско способов доставки.
  </div>
  <div class="delivery__content">
    <div class="delivery__method">
      <p><span>Способ номер раз.</span> Мы отправляем товар Почтой России. Это очень удобно и надежно, особенно если вы живете не в центральных регионах России. Процедура отправки состоит из формирования и согласования заказа, онлайн-оплаты и отправки. Обычно доставка до самых отдаленных регионов не превышает двух недель.  Стоимость такой доставки составляет 390 рублей вне зависимости от расстояния и веса товара. Время в пути: от 4 дней до 2 недель. Если этот вариант для вас окажется неприемлимым мы можем предложить доставку компанией СДЭК. Это существенно быстрее и, зачастую, дешевле чем Почта России. Более 800 пунктов выдачи позволят вам сэкономить на доставке. </p>
    </div>
    <div class="delivery__method">
      <p><span>Способ номер два.</span> Если вы проживаете в городе Санкт-Петербург, мы можем доставить вам ваш заказ курьерской службой, в удобное для вас время.</p>
    </div>
    <div class="delivery__method">
      <p>Любые вопросы можно всегда обсудить по телефону <strong>+7 (963) 042-42-43</strong>
Спасибо что выбрали нас, мы вас не разочаруем!</p>
    </div>
  </div>
</div>
@endsection
