<?php
use App\Product;
use Illuminate\Database\Seeder;
class ProductsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
      for($i = 1; $i < 20; $i++){
        Product::create([
          'name' => 'BCAA' . $i,
          'slug' => 'bcaa' . $i,
          'details' => 'Комплекс аминокислот',
          'price' => rand(1000, 2999),
          'description' => ' аминокислотный комплекс, обогащенный ВСАА (лейцином, изолейцином, валином), глутамином и аргинином. Благодаря своему составу, продукт обеспечивает постоянную высокую концентрацию в крови аминокислот - строительного материала для мышц, так как в него входят: свободные аминокислоты, легко усваиваемый сывороточный белок',
          // 'category_id' => 1,
        ])->categories()->attach(1);
      }
      for($i = 1; $i < 10; $i++){
        Product::create([
          'name' => 'Protein' . $i,
          'slug' => 'protein' . $i,
          'details' => 'Сывороточный протеин',
          'price' => rand(1999,2999),
          'description' => 'Продукт специально разработан для спортсменов и людей, ведущих активный образ жизни. Muscle Rush Whey изготовлен исключительно из натуральных ингредиентов. Muscle Rush Whey - выбор тех, кто хочет находиться на пике физической активности!',
          // 'category_id' => 2,
        ])->categories()->attach(2);
      }
      for($i = 1; $i < 10; $i++){
        Product::create([
          'name' => 'Creatine' . $i,
          'slug' => 'creatine' . $i,
          'details' => 'Чистый креатин в порошке',
          'price' => 999,
          'description' => 'Креатин, пожалуй, самая изученная и проверенная из всех спортивных добавок. Через определенное количество ферментативных и клеточных шагов, креатин сначала метаболизируется в такое соединение как креатина фосфат, а в конечном счете в соединение',
          // 'category_id' => 3,
        ])->categories()->attach(3);
      }
      for($i = 1; $i < 10; $i++){
        Product::create([
          'name' => 'L-Carnetine' ,$i,
          'slug' => 'l-carnetine' ,$i,
          'details' => 'L-Carnetine',
          'price' => rand(999,2499),
          'description' => 'L-карнитин является производной аминокислоты лизин, и, при определенных условиях, когда потребность в нем больше, чем способность организма синтезировать его, является условно незаменимой аминокислотой',
          // 'category_id' => 4,
        ])->categories()->attach(4);
      }
      for($i = 1; $i < 15; $i++){
        Product::create([
          'name' => 'Витамины' . $i,
          'slug' => 'vitaminy' . $i,
          'details' => 'Комплекс витаминов',
          'price' => rand(1999,3999),
          'description' => 'Когда речь заходит о здоровье ваших костей, один только кальций не работает. Наша уникальная формула дает 1000 мг кальция на прием плюс такие ко-факторы, как бор, медь, магний и цинк.',
          // 'category_id' => 5,
        ])->categories()->attach(5);
      }
    }
}
